{"backend": "tensorflow", "config": [{"config": {"filters": 64, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "name": "conv2d_4", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 64, 64, 3], "dilation_rate": [1, 1], "padding": "valid", "dtype": "float32", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "name": "conv2d_5", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "name": "conv2d_6", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "strides": [1, 1], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "relu", "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activation": "sigmoid", "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}